export const FIRST_CALENDAR_DAY = 23;
export const LAST_CALENDAR_DAY = 31;

export const DAY_TASKS: Record<number, string> = {
  23: `## 🔥 День 1: благодарность
  \nХо-Хо! Вот и первый день Advent-календаря.
  
  ### ✍️ Правила очень простые:
  \nвозьми блокнот и ручку или записывай всё в заметки на телефоне, когда выполняешь задания.
  
  \nЛюди, которые нас окружают, — это самая важная ценность, благодаря которой нам тепло и легко. Поэтому начнём этот день с благодарности.
  
  \n### Задание
  
  
  \n 1\\. Выпиши 3–5 человек, которые повлияли на тебя больше всего в этом году.
  
  \n 2\\. Напиши, как именно каждый из них на тебя повлиял
  
  *P.S.* Это не обязательно должно быть что-то грандиозное. Порой важно просто то, чтоб с нами кто-то был.
  
  
  -----
  
  \n Когда все запишешь, сохрани это где-нибудь, чтобы не потерять — это пригодится нам в дальнейшем.
  \n Увидимся завтра ☀️
  `,
  24: `## **День 2: самые яркие моменты этого года**
    \nПривет! Переходим ко второму дню. Если ты не выполнил задание первого дня — не переживай, ты можешь вернуться к нему позже.
    \nПравил все теже: возьми блокнот и ручку или записывай всё из заданий себе в заметки.
    \nЧтобы войти в **Новый год** с пониманием, как мы хотим его провести, стоит сначала немного вспомнить прошлый.
    
    \nМы часто склонны обесценивать свои достижения (я так часто делаю 😅).  
    
    \nДаже если тебе кажется, что ничего не произошло, поверь, у каждого за год найдётся что вспомнить.
    
    \n### Задание
    \nВспомни и выпиши **три самых ярких** события этого года.  
    \nЭто могут быть как крупные достижения, так и просто приятные события. Например, поездка, встреча, новый навык или даже просто тёплый вечер дома. Напиши, почему они остались в твоей памяти.
    
    \n#### Подсказка
    \nСначала можешь выписать вообще всё, что приходит в голову. Запиши 5–10 событий. А из них уже легче выбрать 3-5 самых важных.
    
    \nНу все, мне пора бежать и готовить подарки 🎁.
    \nНе теряй свои заметки и увидимся завтра 😉
    `,
  25: `## **День 3**
    \nХо-хо-хо! 
    \n☃️ А вот и третий день нашего адвент-календаря. До Нового года остались считанные дни, а значит, самое время вспомнить, что вдохновляло нас в этом году.
    
    \n### Задание
    
    \n 1\\. Вспомни, какие книги ты прочитал(-a) в этом году. Тут нет ограничений: одна книга — уже отлично, 10 — супер, 100… эээ, научи меня читать также быстро, пожалуйста.
    
    \n-----
    
    \n*P.S.* Если весь год ты читал(-a) только переписки в мессенджерах 🤓 - не беда, вспомни, какие курсы ты прошел(-а) или чему новому научился(-ась) в этом году.
    
    \n-----
    
    \n 2\\. Напиши, как именно каждая из книг на тебя повлияла.
    \n 3\\. Для самых активных - напиши список книг, которые ты бы хотел(-а) прочитать в следующем году. Хотя бы примерный — потом его всегда можно скорректировать
    
    \n#### Подсказка
    
    \nМожет есть что-то, что ты все время откладываешь, и вот сейчас самое время выписать это себе. 
   
    \nЕсли чтение это не твой вид потребления контента, то напиши список курсов или навыков, которые хотелось бы развить в следующем году.
    
    \n-----
    
    \nОтлично! Теперь у нас есть понимание, что вдохновляло и заряжало нас в этом году, и чему новому мы научились. Если у тебя уже есть хотя бы примерный список книг или курсов на следующий год — ну ты просто лучший(-ая)! ⚡ ️
    \nНе теряй свои заметки и увидимся завтра, кажется будет что-то супер интересное 😉
    `,
};
